БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиОбновленияСправочниковЕГИСЗ/НастройкиОбновленияСправочниковЕГИСЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОбновленияСправочниковЕГИСЗ</name>
  <resources>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РежимОбновления</name>
    <type>
      <types>EnumRef.РежимыАвтоОбновленияСправочниковЕГИСЗ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВерсии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Классификатор</name>
    <comment>OID классификатора</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ДолжностиМинздрава/ДолжностиМинздрава.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДолжностиМинздрава</name>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолжностьМинздрава</name>
    <type>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/ПрохождениеМедосмотра/ПрохождениеМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеМедосмотра</name>
  <registerRecords>InformationRegister.НаправленияПоРезультатамМедосмотра</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательМедКомиссии</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокНаПрохождениеМедосмотра</name>
    <type>
      <types>DocumentRef.СписокНаПрохождениеМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВПроведенииДопОбследования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВОбследованииВЦентреПрофпатологии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВАмбулаторномОбследованииИЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВСтационарномОбследованииИЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВСанаторноКурортномЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВДиспансерномНаблюдении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВЛечебноПрофилактическомПитании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВНаправленииНаМедикоСоциальнуюЭкспертизу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтойкаяУтратаТрудоспособности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДиспансернаяГруппа</name>
    <type>
      <types>EnumRef.ГруппыЗдоровья</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМедосмотра</name>
    <type>
      <types>EnumRef.ТипыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзвещениеОПредварительномДиагнозеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзвещениеОПредварительномДиагнозеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Жалобы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исследования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Осмотр</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяКарта</name>
    <type>
      <types>CatalogRef.МедицинскиеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрохожденияМО</name>
    <type>
      <types>EnumRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ОказаниеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьГруппаЗдоровья</name>
    <comment>(используется реквизит ДиспансернаяГруппа)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуВАрхиве</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеРЭМД</name>
    <type>
      <types>CatalogRef.СообщенияРЭМД</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКлиента</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦехУчасток</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Профессия</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРаботы</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тестовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолиса</name>
    <comment>Условия обслуживания по медосмотру в рамках договора с контрагентом</comment>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМО</name>
    <type>
      <types>CatalogRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОПрививках</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфекционныйАнамнез</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКЗаключению</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННРаботодателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияМедосмотра</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначенДополнительно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КритичныеПротивопоказания</name>
    <attributes>
      <name>Противопоказание</name>
      <type>
        <types>CatalogRef.МедицинскиеПротивопоказания</types>
      </type>
    </attributes>
    <attributes>
      <name>Диагноз</name>
      <type>
        <types>CatalogRef.Диагнозы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДетализацияДиагноза</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УточненностьДиагноза</name>
      <type>
        <types>EnumRef.КлассификацииДиагнозов</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактерЗаболевания</name>
      <type>
        <types>EnumRef.КлассификацииДиагнозов</types>
      </type>
    </attributes>
    <attributes>
      <name>Профессиональное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыявленВпервые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрофнепригодностьВременная</name>
      <type>
        <types>EnumRef.ХарактерПрофнепригодности</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВредныеФакторыПротивопоказаний</name>
    <attributes>
      <name>ВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФакторыИУсловияРаботы</name>
    <attributes>
      <name>Фактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПриема</name>
    <comment>Используется только для справок и прочих медосмотров. Не используется для периодических медосмотров работников</comment>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиИПодписиЭМД</name>
    <attributes>
      <name>УИД_ЭМД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_ЭЦП</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиПриПодписиМедДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьМинздрава</name>
      <type>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭМД</name>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЭМД</name>
      <type>
        <types>CatalogRef.ШаблоныHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокументаЭМД</name>
      <type>
        <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКФайлуВАрхиве</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеРЭМД</name>
      <type>
        <types>CatalogRef.СообщенияРЭМД</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриказВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
        <types>CatalogRef.ПриказыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_Шаблона</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИдентификаторыПриказов</name>
    <attributes>
      <name>ПриказВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
        <types>CatalogRef.ПриказыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Catalogs/КлассификаторыМинЗдрава/КлассификаторыМинЗдрава.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторыМинЗдрава</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлассификатора</name>
    <type>
      <types>EnumRef.ВидыКлассификаторовМинЗдрава</types>
    </type>
  </attributes>
  <attributes>
    <name>НПП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Атрибуты</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonModules/ИнтеграцияЕГИСЗВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура СозданиеИзменениеПациента(Пациент, ПервичныйВводПациента = Ложь) Экспорт
	
	ИнтеграцияЕГИСЗ_ГИП.СозданиеИзменениеПациента(Пациент, ПервичныйВводПациента);
	
КонецПроцедуры

Функция ЗапросДанныхОПациенте(
	ИдентификаторПациента = Неопределено,
	Фамилия = Неопределено,
	Имя = Неопределено,
	Отчество = Неопределено,
	ДатаРождения = Неопределено,
	Пол = Неопределено,
	Снилс = Неопределено
	) Экспорт
	
	Возврат ИнтеграцияЕГИСЗ_ГИП.ЗапросДанныхОПациенте(ИдентификаторПациента, Фамилия, Имя, Отчество, ДатаРождения, Пол, Снилс);
	
КонецФункции

Функция ПроверитьНеобходимостьАвтоОбновления(НаименованиеСправочника, OIDСправочника = Неопределено) Экспорт
	
	Если OIDСправочника = Неопределено Тогда
		МенеджерСправочника = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Справочник." + НаименованиеСправочника);
		
		Попытка
			OIDСправочника = МенеджерСправочника.ПолучитьOIDСправочника();
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	РезультатПроверки = Новый Структура();
	МенеджерЗаписи = РегистрыСведений.НастройкиОбновленияСправочниковЕГИСЗ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Классификатор = OIDСправочника;
	МенеджерЗаписи.Прочитать();
	
	РезультатПроверки.Вставить("Режим", МенеджерЗаписи.РежимОбновления);
	РезультатПроверки.Вставить("ТекущаяВерсия", МенеджерЗаписи.Версия);
	
	Версии = ЗагрузкаКлассификаторовНСИЕГИСЗ.ПолучитьВсеВерсииКлассификатора(OIDСправочника);
	Если Версии <> Неопределено Тогда
		ДанныеОТекущейВерсии = Версии.НайтиСтроки(Новый Структура("Версия",МенеджерЗаписи.Версия));
		Если ДанныеОТекущейВерсии.Количество() > 0 Тогда
			ДатаТекущейВерсии = ДанныеОТекущейВерсии[0].ДатаОбновления;
		КонецЕсли;
		ПоследняяВерсия = Версии[Версии.Количество()-1].Версия;
		ДатаПоследнейВерсии = Версии[Версии.Количество()-1].ДатаОбновления;
	КонецЕсли;
	
	РезультатПроверки.Вставить("Oid",					OIDСправочника);
	РезультатПроверки.Вставить("ПоследняяВерсия",		ПоследняяВерсия);
	РезультатПроверки.Вставить("ДатаТекущейВерсии",		ДатаТекущейВерсии);
	РезультатПроверки.Вставить("ДатаПоследнейВерсии",	ДатаПоследнейВерсии);
	РезультатПроверки.Вставить("ВерсияУстарела",		РезультатПроверки.ТекущаяВерсия <> ПоследняяВерсия); // Невозможно иметь текущий номер версии больше, чем последняя в ФР НСИ.
	
	Возврат РезультатПроверки;
	
КонецФункции

Функция ОбновитьСправочник(OidСправочника) Экспорт
	
	Возврат ИнтеграцияЕГИСЗСервер.ОбновитьСправочник(OidСправочника);
	
КонецФункции 

Функция ПолучитьПроблемыСЭМДПередПодписанием(Документ) Экспорт
	
	Возврат ИнтеграцияЕГИСЗ_СЭМД.ПолучитьПроблемыСЭМДПередПодписанием(Документ);
	
КонецФункции

Функция ПолучитьXMLПоСсылкеМД(Ссылка, СвойстваЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, НаименованиеШаблона, ТекстОшибки, ДополнительныеПараметры) Экспорт
	
	Возврат ИнтеграцияЕГИСЗ_СЭМД.ПолучитьXMLПоСсылкеМД(Ссылка, СвойстваЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, НаименованиеШаблона, ТекстОшибки, ДополнительныеПараметры);
	
КонецФункции

Функция ДокументЯвляетсяЗаключениемМедосмотра(Документ) Экспорт
	
	Возврат ДопСерверныеФункции.ИмяСсылочногоТипа(Документ) = "Документ.ПрохождениеМедосмотра" И Документ.ВидПрохожденияМО <> Перечисления["ВидыМедосмотров"].СправкаПрочий;
	
КонецФункции

Функция ИмеютсяОшибкиВалидацииПоДокументу(МедицинскийДокумент) Экспорт
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент);
	СотрудникУстановившийПодпись = Пользователи.ТекущийПользователь().Сотрудник;
	
	ДополнительныеПараметры = ИнтеграцияЕГИСЗ_СЭМД.ДополнительныеПараметрыДляРаботыССЭМД();
	
	ДолжностьМЗ = Неопределено;
	ДолжностиСотрудника = ИнтеграцияЕГИСЗВызовСервера.ДолжностиМЗ(СотрудникУстановившийПодпись);
	Если ДолжностиСотрудника.Количество() > 0 Тогда
		// Для проверки на наличие ошибок подойдёт любая должность
		ДолжностьМЗ = ДолжностиСотрудника[0];
	КонецЕсли;
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		Для Каждого СтрокаШаблона Из МедицинскийДокумент.ШаблоныПриема Цикл
			ДополнительныеПараметры.ШаблонОсмотра = СтрокаШаблона.ШаблонПриема;
			ДополнительныеПараметры.ИндексШаблона = МедицинскийДокумент.ШаблоныПриема.Индекс(СтрокаШаблона);
			
			Если ИмеютсяОшибкиВалидацииПоШаблону(МедицинскийДокумент, СотрудникУстановившийПодпись, ДолжностьМЗ, ДополнительныеПараметры) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		Если ЗначениеЗаполнено(МедицинскийДокумент.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки) Тогда
			ДополнительныеПараметры.ШаблонОсмотра = МедицинскийДокумент.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки;
			Возврат ИмеютсяОшибкиВалидацииПоШаблону(МедицинскийДокумент, СотрудникУстановившийПодпись, ДолжностьМЗ, ДополнительныеПараметры);
		Иначе
			МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
			ОбработанныеПриказы = Новый Массив;
			Для Каждого СтрокаФактора Из МедицинскийДокумент.ФакторыИУсловияРаботы Цикл
				Если МодульМедосмотрыСервер.ЭтоПриказСправки(СтрокаФактора.Фактор.Приказ) Тогда
					Если ОбработанныеПриказы.Найти(СтрокаФактора.Фактор) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ДополнительныеПараметры.ШаблонОсмотра = СтрокаФактора.Фактор.ШаблонОсмотраСправки;
					ДополнительныеПараметры.ВредныйФакторСправки = СтрокаФактора.Фактор;
					ДополнительныеПараметры.ПриказМО = Неопределено;
					
					Если ИмеютсяОшибкиВалидацииПоШаблону(МедицинскийДокумент, СотрудникУстановившийПодпись, ДолжностьМЗ, ДополнительныеПараметры) Тогда
						Возврат Истина;
					КонецЕсли;
					ОбработанныеПриказы.Добавить(СтрокаФактора.Фактор);
				Иначе
					Если ОбработанныеПриказы.Найти(СтрокаФактора.Фактор.Приказ) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ДополнительныеПараметры.ШаблонОсмотра = Неопределено;
					ДополнительныеПараметры.ВредныйФакторСправки = Неопределено;
					ДополнительныеПараметры.ПриказМО = СтрокаФактора.Фактор.Приказ;
					
					Если ИмеютсяОшибкиВалидацииПоШаблону(МедицинскийДокумент, СотрудникУстановившийПодпись, ДолжностьМЗ, ДополнительныеПараметры) Тогда
						Возврат Истина;
					КонецЕсли;
					ОбработанныеПриказы.Добавить(СтрокаФактора.Фактор.Приказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
		Возврат ИмеютсяОшибкиВалидацииПоШаблону(МедицинскийДокумент, СотрудникУстановившийПодпись, ДолжностьМЗ, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьСписокLocalidПоВидуДокумента(ВидДокумента) Экспорт
	
	МакетXML = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьМакетСправочникаПоВидуДокумента(ВидДокумента);
	Если ЗначениеЗаполнено(МакетXML) Тогда
		Возврат ИнтеграцияЕГИСЗ_СЭМД.СписокLocalidМакета(МакетXML);
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	
КонецФункции

Процедура ПересчитатьОбязательныеПоляLocalid(мСтрокиLocalid, мСтрокиКонстант) Экспорт
	
	ИнтеграцияЕГИСЗ_СЭМД.ПересчитатьОбязательныеПоляLocalid(мСтрокиLocalid, мСтрокиКонстант);
	
КонецПроцедуры

Функция ДолжностиМЗ(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должности.ДолжностьМинздрава КАК ДолжностьМинздрава,
		|	0 КАК Приоритет
		|ИЗ
		|	Справочник.Должности КАК Должности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО (Сотрудники.Ссылка = &Сотрудник)
		|			И Должности.Ссылка = Сотрудники.Должность
		|			И (Должности.ДолжностьМинздрава <> ЗНАЧЕНИЕ(Справочник.КлассификаторыМинЗдрава.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДолжностиМинздрава.ДолжностьМинздрава,
		|	1
		|ИЗ
		|	РегистрСведений.ДолжностиМинздрава КАК ДолжностиМинздрава
		|ГДЕ
		|	ДолжностиМинздрава.Сотрудник = &Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДолжностьМинздрава");
	
КонецФункции

Функция ЭлементКлассификатораПоУИДЕГИСЗ(УИДЕГИСЗ, ВидКлассификатора = Неопределено, ИмяСправочникаКлассификатора = Неопределено) Экспорт
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(УИДЕГИСЗ, ВидКлассификатора, ИмяСправочникаКлассификатора);
КонецФункции

Функция ПроверитьСоответствиеТиповКлассификацийВитальныхПараметров(ВитальныеПараметры) Экспорт
	
	Возврат ИнтеграцияЕГИСЗ_СЭМД.ПроверитьСоответствиеТиповКлассификацийВитальныхПараметров(ВитальныеПараметры);
	
КонецФункции

Функция ПолучитьСтруктуруТипаЗначенияВитальногоПараметра(ВитальныйПараметр) Экспорт
	
	СтруктураТипа = Новый Структура("Тип, ВидКлассификатора");
	
	Если ТипЗнч(ВитальныйПараметр) = Тип("СправочникСсылка.КлассификаторыМинЗдрава")
		И ВитальныйПараметр.ВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.ВитальныеПараметры
	Тогда
		СтрокиАтрибутаТипа = ВитальныйПараметр.Атрибуты.НайтиСтроки(Новый Структура("Ключ", "DATA_TYPE"));
		Если СтрокиАтрибутаТипа.Количество() > 0 Тогда
			СтруктураТипа.Тип = ИнтеграцияЕГИСЗ_СЭМД.ТипДанныхИзXML(СтрокиАтрибутаТипа[0].Значение);
		КонецЕсли;
		
		СтрокиАтрибутаВидаКлассификатора = ВитальныйПараметр.Атрибуты.НайтиСтроки(Новый Структура("Ключ", "OID"));
		Если СтрокиАтрибутаВидаКлассификатора.Количество() > 0 Тогда
			ПараметрыСправочника = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПараметрыСправочникаЕГИСЗ(СтрокиАтрибутаВидаКлассификатора[0].Значение);
			Если ПараметрыСправочника.Свойство("ВидКлассификатора") Тогда
				СтруктураТипа.ВидКлассификатора = ПараметрыСправочника.ВидКлассификатора;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураТипа;
	
КонецФункции

Функция ПолучитьПриказВредныйФакторПоУИД(ПМО, УИД) Экспорт
	
	СтрокаПриказа = ПМО.ИдентификаторыПриказов.Найти(УИД, "УИД");
	Если СтрокаПриказа <> Неопределено Тогда
		Возврат СтрокаПриказа.ПриказВредныйФактор;
	КонецЕсли;
	
	Возврат Справочники.ПриказыМедосмотров.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьУИДПоПриказуВредномуФактору(ПМО, ПриказВредныйФактор) Экспорт
	
	СтрокаПриказа = ПМО.ИдентификаторыПриказов.Найти(ПриказВредныйФактор, "ПриказВредныйФактор");
	Если СтрокаПриказа <> Неопределено Тогда
		Возврат СтрокаПриказа.УИД;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДанныеСтраховойМедОрганизации(СМО) Экспорт
	
	Результат = Новый Структура();
	
	Если ЗначениеЗаполнено(СМО) И ТипЗнч(СМО) = Тип("СправочникСсылка.РеестрСтраховыхМедОрганизаций") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеестрСтраховыхМедОрганизаций.Наименование КАК Наименование,
			|	РеестрСтраховыхМедОрганизаций.ОГРН КАК ОГРН,
			|	РеестрСтраховыхМедОрганизаций.КПП КАК КПП,
			|	РеестрСтраховыхМедОрганизаций.ПолноеНаименование КАК ПолноеНаименование
			|ИЗ
			|	Справочник.РеестрСтраховыхМедОрганизаций КАК РеестрСтраховыхМедОрганизаций
			|ГДЕ
			|	РеестрСтраховыхМедОрганизаций.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", СМО);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выгрузка = РезультатЗапроса.Выгрузить();
		Для Каждого СтрокаТЗ Из Выгрузка Цикл
			Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТЗ);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверка существует ли файл
Функция ФайлСуществует(ИмяФайла) Экспорт
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Существует();
	
КонецФункции

Функция ПолучитьДДФайла(ИмяФайла) Экспорт
	
	Попытка
		Возврат Новый ДвоичныеДанные(ИмяФайла);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МенеджерКриптографии(Операция, ПараметрыСозданияМенеджераКриптографии = Неопределено) Экспорт
	Возврат ЭлектроннаяПодписьСлужебный.МенеджерКриптографии(Операция, ПараметрыСозданияМенеджераКриптографии);
КонецФункции

Функция Подписать(Знач КонвертSOAP, ДанныеАлгоритмаПодписания, СертификатКриптографии, МенеджерКриптографии) Экспорт
	Возврат ЭлектроннаяПодписьСлужебный.Подписать(КонвертSOAP, ДанныеАлгоритмаПодписания, СертификатКриптографии, МенеджерКриптографии);
КонецФункции

Функция ПараметрыСозданияМенеджераКриптографии() Экспорт
	Возврат ЭлектроннаяПодписьСлужебный.ПараметрыСозданияМенеджераКриптографии();
КонецФункции

Функция ПолучитьДДСертификата(Сертификат) Экспорт
	Возврат Сертификат.ДанныеСертификата.Получить();
КонецФункции

Функция ПолучитьСтрокуПоXPath(ДокументDOM, Знач Разыменователь = Неопределено, XPath) Экспорт
	
	Если Неопределено = Разыменователь Тогда
		Разыменователь = ДокументDOM.СоздатьРазыменовательПИ();
	КонецЕсли;
	
	ТипРезультата = ТипРезультатаDOMXPath.Строка;
	
	РезультатXPath = ДокументDOM.ВычислитьВыражениеXPath(
		XPath, ДокументDOM, Разыменователь, ТипРезультата
	);
	
	Возврат РезультатXPath.СтроковоеЗначение;
	
КонецФункции

Процедура ЗаписатьДанныеОтправленногоСообщенияВРегистр(УИДСообщения, ДатаСообщения, ИдентификаторДокумента, ИдентификаторРЭМД = Неопределено, Объект = Неопределено) Экспорт
	ИнтеграцияЕГИСЗ_РЭМД.ЗаписатьДанныеОтправленногоСообщенияВРегистр(УИДСообщения, ДатаСообщения, ИдентификаторДокумента, ИдентификаторРЭМД, Объект);
КонецПроцедуры

Функция ПолучитьСодержимоеЭлемента(РодительскийУзелDOM, ИмяЭлемента, Индекс = 0) Экспорт
	Возврат ИнтеграцияЕГИСЗСлужебныйСервер.ПолучитьСодержимоеЭлемента(РодительскийУзелDOM, ИмяЭлемента, Индекс);
КонецФункции

Функция ЗаписатьВЖурналРегистрации(ИмяСобытия, ПредставлениеУровня = Неопределено, ОбъектМетаданных = Неопределено, Данные = Неопределено, Комментарий = Неопределено, РежимТранзакции = Неопределено) Экспорт
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньСобытияПоПредставлению(ПредставлениеУровня), ОбъектМетаданных, Данные, Комментарий, РежимТранзакции);
КонецФункции

Функция УровеньСобытияПоПредставлению(ПредставлениеУровня) Экспорт
	Если ПредставлениеУровня = "Информация" Тогда
		Возврат УровеньЖурналаРегистрации.Информация;
	ИначеЕсли ПредставлениеУровня = "Ошибка" Тогда
		Возврат УровеньЖурналаРегистрации.Ошибка;
	ИначеЕсли ПредставлениеУровня = "Предупреждение" Тогда
		Возврат УровеньЖурналаРегистрации.Предупреждение;
	ИначеЕсли ПредставлениеУровня = "Примечание" Тогда
		Возврат УровеньЖурналаРегистрации.Примечание;
	КонецЕсли;
КонецФункции

Процедура ЕГИСЗ_ОбработкаПолученияФормыОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если ВидФормы = "ФормаОбъекта" Или ВидФормы = "ФормаГруппы" Тогда
		МетаданныеСправочника = Источник.ПустаяСсылка().Метаданные();
		ЭлементСоставаРеквизита =  Метаданные.ОбщиеРеквизиты.УИДЕГИСЗ.Состав.Найти(МетаданныеСправочника);
		Если ЭлементСоставаРеквизита <> Неопределено
			И ЭлементСоставаРеквизита.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать
			И МетаданныеСправочника.ОсновнаяФормаОбъекта = Неопределено
		Тогда
			СтандартнаяОбработка = Ложь;
			Если Параметры.Свойство("Ключ") Тогда
				Ссылка = Параметры.Ключ;
			Иначе
				Ссылка = Источник.ПустаяСсылка();
			КонецЕсли;
			Параметры.Вставить("СправочникСсылка", Ссылка);
			ВыбраннаяФорма = Метаданные.ОбщиеФормы.ЭлементКлассификатораЕГИСЗ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ИмеютсяОшибкиВалидацииПоШаблону(МедицинскийДокумент, СотрудникУстановившийПодпись, ДолжностьМЗ, ДополнительныеПараметры)
	
	ОшибкиВалидации = Новый ТаблицаЗначений;
	ОшибкиВалидации.Колонки.Добавить("Текст");
	ОшибкиВалидации.Колонки.Добавить("Правило");
	ОшибкиВалидации.Колонки.Добавить("Расположение");
	
	СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(МедицинскийДокумент, ДополнительныеПараметры);
	Если ЗначениеЗаполнено(СвойстваЭМД.ВидРЭМД.Схематрон) Тогда
		ИнтеграцияЕГИСЗ_СЭМД.ЗаполнитьОшибкиВалидацииПоСхематрону(СвойстваЭМД.ВидРЭМД.Схематрон, ОшибкиВалидации, МедицинскийДокумент, СотрудникУстановившийПодпись, ДолжностьМЗ, СвойстваЭМД.ВидРЭМД, ДополнительныеПараметры);
		Если ОшибкиВалидации.Количество() > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПроверитьЗаполненностьОбязательныхРеквизитовВрача(Врач, НезаполненныеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Врач.СНИЛС) Тогда
		НезаполненныеРеквизиты.Добавить(НСтр("ru='СНИЛС врача'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Врач.Подразделение) Тогда
		НезаполненныеРеквизиты.Добавить(НСтр("ru='Подразделение врача'"));
	ИначеЕсли Не ЗначениеЗаполнено(Врач.Подразделение.ПодразделениеМинздрава) Тогда
		НезаполненныеРеквизиты.Добавить(НСтр("ru='Подразделение минздрава в подразделении врача'"));
	КонецЕсли;
	
	ДолжностиМЗ = ДолжностиМЗ(Врач);
	
	Если ДолжностиМЗ.Количество() = 0 Тогда
		НезаполненныеРеквизиты.Добавить(НСтр("ru='Должность минздрава'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполненностьОбязательныхРеквизитовКлиента(Клиент, НезаполненныеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Клиент.СНИЛС) Тогда
		НезаполненныеРеквизиты.Добавить(НСтр("ru='СНИЛС клиента'"));
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИмяФормыВыбораКлассификатораПоТипу(ТипКлассификатора) Экспорт
	
	Попытка
		ЭлементКлассификатора = Новый(ТипКлассификатора);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	МетаданныеКлассификатора = ЭлементКлассификатора.Метаданные();
	
	Если Метаданные.ОбщиеРеквизиты.УИДЕГИСЗ.Состав.Найти(МетаданныеКлассификатора) <> Неопределено Тогда
		Возврат СтрШаблон("%1.ФормаВыбора", МетаданныеКлассификатора.ПолноеИмя());
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
